c5/src/Documents/ChangesPermission/ChangesPermission.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ChangesPermission</name>
  <posting>Deny</posting>
  <attributes>
    <name>Class</name>
    <type>
      <types>CatalogRef.Metadata</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Day</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Document</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Expired</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Organization</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Resolution</name>
    <type>
      <types>EnumRef.AllowDeny</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/Enums/AllowDeny/AllowDeny.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AllowDeny</name>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Deny</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/ChangesPermission/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		raise Output.InteractiveCreationForbidden ();
	endif;
	if ( not PermissionForm.Completed ( Object )
		and Constraints.CanAllow () ) then
		PermissionForm.Init ( Object );
	endif;
	readAppearance ();
	Appearance.Apply ( ThisObject );

EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Expired show Object.Resolution = Enum.AllowDeny.Allow;
	|Organization show filled ( Object.Organization );
	|Class show empty ( Object.Document );
	|Document show filled ( Object.Document );
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	PermissionForm.SendChangesResponse ( Object );
	
EndProcedure

&AtClient
Procedure AfterWrite ( WriteParameters )

	Notify ( Enum.MessageChangesPermissionIsSaved (), ? ( Object.Document = undefined, Object.Day, Object.Document ) );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure ResolutionOnChange ( Item )
	
	PermissionForm.ApplyResolution ( Object );
	Appearance.Apply ( ThisObject, "Object.Resolution" );

EndProcedure
